# Напишите генератор generate_random_name(), используя модуль random,
# который генерирует два слова из латинских букв от 1 до 15 символов, разделенных пробелами
# Например при исполнении следующего кода:
# gen = generate_random_name()
# print(next(gen))
# print(next(gen))
# print(next(gen))
# print(next(gen))
#
# Выводится:
# tahxmckzexgdyt ocapwy
# dxqebbukr jg
# aym jpvezfqexlv
# iuy qnikkgxvxfxtxv

from random import sample, randint


alphabet = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't',
            'u', 'v', 'w', 'x', 'y', 'z']


def generate_random_name():
    while True:
        first_name = sample(alphabet, randint(1, 15))
        second_name = sample(alphabet, randint(1, 15))
        yield ''.join(first_name) + ' ' + ''.join(second_name)


gen = generate_random_name()
print(next(gen))
print(next(gen))
print(next(gen))
print(next(gen))
